In [1]:
import pandas as pd

In [2]:
data = {"customer_id":[1,2,3,4,5,6],
        "name":['Ella', 'David', 'Zachary', 'Alice', 'Finn', 'Violet'],
        "email":['emily@example.com',
                 'michael@example.com',
                 'sarah@example.com',
                 'john@example.com',
                 'john@example.com',
                 'alice@example.com']}
df = pd.DataFrame(data)

éœ€è¦å»é™¤é‡å¤çš„è¡Œå†…å®¹ï¼ˆemailåˆ—ä¸­æœ‰é‡å¤ï¼‰,å¹¶ä¿ç•™ç¬¬ä¸€ä¸ªå‡ºç°çš„è¡Œå†…å®¹

In [3]:
df.drop_duplicates('email')

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

_____

In [4]:
data = {"student_id":[32, 217, 779, 849],
        "name":['Piper', None, 'Georgia', 'Willow'],
        "age":[5, 19, 20, 14]}
df = pd.DataFrame(data)

å»é™¤æ‰'name'åˆ—ä¸­çš„ç©ºå€¼

In [5]:
df.dropna(subset='name')

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14

_____

In [6]:
data = {"name":['Wristwatch', 'WirelessEarbuds', 'GolfClubs', 'Printer'],
        "quantity":[None, None, 779, 849],
        "price":[135, 821, 9319, 3051]}
df = pd.DataFrame(data)

å°†'quantity'ä¸­çš„ç©ºå€¼è®¾ä¸º0

In [7]:
df['quantity'].fillna(0, inplace=True)

In [8]:
df

              name  quantity  price
0       Wristwatch       0.0    135
1  WirelessEarbuds       0.0    821
2        GolfClubs     779.0   9319
3          Printer     849.0   3051

___

In [9]:
data1 = {'student_id':[1,2,3,4],
         'name':['Mason', 'Ava', 'Taylor', 'Georgia'],
         'age':[8, 6, 15, 17]}
data2 = {'student_id':[5,6],
         'name':['Leo', 'Alex'],
         'age':[7, 7]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

å°†df1å’Œdf2å‚ç›´åˆå¹¶ï¼ˆé»˜è®¤ï¼‰

In [10]:
# ignore_index=Trueçš„ä½œç”¨æ˜¯å¿½ç•¥ç´¢å¼•ï¼Œé‡æ–°ç”Ÿæˆè¿ç»­ç´¢å¼•
pd.concat([df1, df2], ignore_index=True)

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17
4           5      Leo    7
5           6     Alex    7

___

In [11]:
data = {'city':['Jacksonville', 'Jacksonville', 'Jacksonville',
                'Jacksonville', 'Jacksonville', 'ElPaso',
                'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso'],
        'month':['January', 'February', 'March', 'April', 'May',
                 'January', 'February', 'March', 'April', 'May'],
        'temperature':[13, 23, 38, 5, 34, 20, 6, 26, 2, 43]}
df = pd.DataFrame(data)

åˆ¶ä½œæ•°æ®é€è§†è¡¨ï¼Œæ ¹æ®æœˆä»½æ˜¾ç¤ºä¸¤ä¸ªåŸå¸‚çš„æ¸©åº¦

In [12]:
df.pivot(index='month', columns='city', values='temperature').sort_index()

city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34

åœ¨ä½¿ç”¨æ•°æ®é€è§†è¡¨pivot()åŠŸèƒ½æ—¶ï¼Œéœ€è¦æ˜ç¡®ä¸‰ä¸ªå‚æ•°ï¼šindex-ç”¨ä»€ä¹ˆå½“ä½œç´¢å¼•ï¼Œcolumns-ç”¨ä»€ä¹ˆå½“ä½œåˆ—åï¼Œvalues-ç”¨ä»€ä¹ˆæ¥å½“ä½œè¡¨æ ¼ä¸­çš„å€¼

___

In [13]:
data = {'product':['Umbrella', 'SleepingBag'],
        'quarter_1':[417, 800],
        'quarter_2':[224, 936],
        'quarter_3':[379, 93],
        'quarter_4':[611, 875]}
df = pd.DataFrame(data)
df

       product  quarter_1  quarter_2  quarter_3  quarter_4
0     Umbrella        417        224        379        611
1  SleepingBag        800        936         93        875

å°†dfä¸­çš„æ•°æ®ï¼ˆæŒ‰å­£åº¦æ¨ªå‘æ’åˆ—ï¼‰æ”¹ä¸ºæŒ‰äº§å“åç§°ï¼ˆçºµå‘æ’åˆ—ï¼‰

In [14]:
df = df.melt(
        id_vars=['product'],
        value_vars=['quarter_1', 'quarter_2', 'quarter_3', 'quarter_4'],
        var_name='quarter',
        value_name='sales'
    )
df

       product    quarter  sales
0     Umbrella  quarter_1    417
1  SleepingBag  quarter_1    800
2     Umbrella  quarter_2    224
3  SleepingBag  quarter_2    936
4     Umbrella  quarter_3    379
5  SleepingBag  quarter_3     93
6     Umbrella  quarter_4    611
7  SleepingBag  quarter_4    875

melt()åŠŸèƒ½ç”¨æ¥æ”¹å˜æ•°æ®çš„å½¢çŠ¶ï¼Œå…¶ä¸­æœ‰å››ä¸ªå‚æ•°ï¼šid_vars, value_vars, var_name, value_nameã€‚

id_vars - åœ¨å¤„ç†è¿‡ç¨‹ä¸­ï¼Œå“ªäº›åˆ—éœ€è¦ä¿æŒä¸å˜ï¼ˆproductï¼‰

value_vars - å“ªäº›åˆ—éœ€è¦è¢«meltæ¥æ”¹å˜å½¢çŠ¶ï¼ˆå„ä¸ªquarterï¼‰

var_name - æ–°çš„åˆ—åç§°ï¼Œæ”¹åˆ—ç”¨æ¥å­˜å‚¨value_varsçš„å¤´éƒ¨åç§°ï¼ˆquarterï¼‰

value_name - æ–°çš„åˆ—åç§°ï¼Œè¯¥åˆ—ç”¨æ¥å­˜å‚¨value_varsçš„å†…å®¹ï¼ˆsalesï¼‰

___

In [15]:
data = {"name":['Tatiana', 'Khaled', 'Alex', 'Jonathan', 'Stefan', 'Tommy'],
        "species":['Snake', 'Giraffe', 'Leopard', 'Monkey', 'Bear', 'Panda'],
        "age":[98, 50, 6, 45, 100, 26],
        "weight":[464, 41, 328, 463, 50, 349]}
df = pd.DataFrame(data)

In [16]:
df.head()

       name  species  age  weight
0   Tatiana    Snake   98     464
1    Khaled  Giraffe   50      41
2      Alex  Leopard    6     328
3  Jonathan   Monkey   45     463
4    Stefan     Bear  100      50

In [17]:
df.loc[df['weight']>100, 'name'].sort_values(by='weight', ascending=False)

TypeError: Series.sort_values() got an unexpected keyword argument 'by'

ç”±äº.sort_values()æ–¹æ³•éœ€è¦å¯¹DataFrameæ“ä½œï¼Œè€Œä½¿ç”¨loc[]æ–¹æ³•é€‰æ‹©å•åˆ—æ•°æ®æ—¶çš„æ•°æ®æ ¼å¼ä¸å¯¹ã€‚åŒæ—¶ï¼Œå¦‚æœæŠŠä»£ç æ”¹æˆä¸‹é¢ğŸ‘‡ï¼Œåˆä¼šå‡ºç°æ–°çš„é—®é¢˜ï¼š

In [18]:
df.loc[df['weight']>100, ['name']].sort_values(by='weight', ascending=False)

KeyError: 'weight'

ç”±äºæ’åºè¿‡ç¨‹ä¸­ï¼Œéœ€è¦ä½¿ç”¨åˆ°'weight'çš„å€¼ï¼Œè€Œåœ¨loc[]ä¸­å¹¶æ²¡æœ‰é€‰æ‹©æ˜¾ç¤º'weight'åˆ—ï¼Œæ•…å‡ºç°é—®é¢˜ã€‚æ­£ç¡®çš„åšæ³•å¦‚ä¸‹ğŸ‘‡

In [19]:
df[df['weight']>100].sort_values(by='weight', ascending=False)[['name']]

       name
0   Tatiana
3  Jonathan
5     Tommy
2      Alex